const info = new Array();
info[1000] = "还没上线正式服的新英雄";
info[1001] = "已进入编辑模式";
info[1002] = "正在上传";
info[1003] = "更改称号需联系站长";
info[1004] = "分路推荐";
info[1005] = "分均经济、场均时长、场均经济";
info[1006] = "暂时还没有该英雄的词条,您也想出力的话请加群:810191707,备注来自本站";
info[1007] = "各个技能的 出场、胜率";
info[1008] = "少则几千、多则几万种组合,仅推荐 场次、胜率 较高的前几十组";
info[1009] = "默认去除 出场、胜率 过低的装备,点击【英雄】或【装备】可查看相关信息";
info[1010] = "未查询到,建议从上方详情进入";
info[1011] = "近期热度有明显上升的。上升过快极有可能挨刀,调整过的几个月内不会再动";
info[1012] = "点击头像可快速对比技能,点击头像右侧数据可查看详情";
info[1013] = "未查询到,待更新";
info[1015] = "请在英雄详情界面喜欢/取消喜欢";

const warning = new Array();
warning[1000] = "分辨率过小,可能会挡住英雄";
warning[1001] = "BP结束,可点击两侧边缘设置胜利方,注意保存";
warning[1002] = "不可提交黄赌毒以及违反国家法律的任何东西,违者直接封号 ;D";
warning[1003] = "似乎没有诶,换个关键词再试试吧 ;(";

const success = new Array();
success[1000] = "操作成功";
success[1001] = "正在查看【该英雄】的装备数据";
success[1002] = "正在查看出【该装备】的英雄数据";
success[1003] = "添加成功,请再选择一个";

const error = new Array();
error[1000] = "已超时";
error[1001] = "对局不存在";
error[1002] = "请点击左侧/右侧边缘设置胜利方";
error[1003] = "请按顺序BP";
error[1004] = "请上传 png/gif/jpg/jpeg 格式的图片";
error[1005] = "图片超过 3MB";
error[1006] = "两支队伍不能相同";
error[1007] = "邮箱或密码为空";
error[1008] = "操作失败";

export default {
    info,
    warning,
    success,
    error
}