const info = new Array();
info[1000] = "还未上线正式服的新英雄";
info[1001] = "已进入编辑模式，请按顺序 BP ;D";
info[1002] = "正在上传";
info[1003] = "更改称号需联系站长";
info[1004] = "分路推荐";
info[1005] = "分均金币、场均时长、场均金币";
info[1006] = "暂无该英雄的词条，您也想出力的话请加群:810191707，备注来自本站";
info[1007] = "各个技能的 出场、胜率";
info[1008] = "少则几千、多则数万种组合，仅推荐 场次、胜率 较高的前几十组";
info[1009] = "默认去除 出场、胜率 过低的装备，点击【英雄】或【装备】可查看相关信息";
info[1010] = "铭文由 @暴走的巅峰赛 提供";
info[1011] = "近期热度有明显上升的。上升过快极有可能挨刀，调整过的几个月内不会再动";
info[1012] = "点击头像可快速对比技能，点击头像右侧数据可查看详情";
info[1013] = "未查询到，待更新";
info[1015] = "请在英雄详情界面 喜欢/取消喜欢";
info[1016] = "上下翻一翻就能看到相关调整了";
info[1017] = "已进入排序模式，拖拽/点击 英雄可修改，注意保存~";
info[1018] = "iOS 使用 Safari 可添加到桌面，安卓推荐使用 Chrome 右上角添加到桌面";
info[1019] = "点击英雄可查看其他大区、省份信息";
info[1020] = "左右横滑、展开行可查看更多信息，一些没有图片的是批量上传的";
info[1021] = "禁选 = 禁用率 + 出场率 的总和"
info[1022] = "该列数据来源【王者营地】，【-】表示为 0 或 和上日对比无变化 ;D"

const warning = new Array();
warning[500] = "加载中...";
warning[1000] = "分辨率过小，可能会挡住英雄";
warning[1001] = "BP结束时，可点击【两侧边缘】设置胜利方，注意保存";
warning[1002] = "打开扩列后别人就能找到您啦~";
warning[1003] = "不可提交黄赌毒以及违反国家法律的任何东西，违规者直接封号 ;D";
warning[1004] = "只是交换双方位置，并不会交换双方 BP 数据 (需要在 BP 开始前交换)";
warning[1005] = "以当前分均预估的速度 (-1 追不上) ，仅供参考 ;D";
warning[1006] = "该账号只能扫码关注 ;(";
warning[1007] = "请先登录账号，完成绑定后下次可用第三方登录 ;(";
warning[1008] = "账号验证失败，请重新登录后再试试 ;(";
warning[1009] = "绑定成功，下次可用第三方登录 :D";

const success = new Array();
success[1000] = "操作成功";
success[1001] = "正在查看【该英雄】的装备数据";
success[1002] = "正在查看出【该装备】的英雄数据";
success[1003] = "添加成功，请再选择一个";
success[1004] = null;
success[1005] = "刷新成功";
success[1006] = "长按或右键保存图片";

const error = new Array();
error[1000] = "已超时";
error[1001] = "对局不存在";
error[1002] = "请点击左侧/右侧边缘设置胜利方，未设置默认蓝色方获胜";
error[1003] = "请按顺序BP";
error[1004] = "请选择 png/gif/jpg/jpeg 格式的图片";
error[1005] = "图片过大，请压缩后再上传";
error[1006] = "两支队伍不能相同";
error[1007] = "邮箱或密码为空";
error[1008] = "操作失败";
error[1009] = "请确认分数";
error[1010] = "请右上角【切换视图】";
error[1011] = "未登录不允许删除最后一局";

export default {
    info,
    warning,
    success,
    error
}