const info = new Array();
info[1000] = "还未上线正式服的新英雄";
info[1001] = "已进入编辑模式，请按顺序 BP";
info[1002] = "正在上传";
info[1003] = "更改称号需要联系站长";
info[1004] = "分路推荐";
info[1005] = "场均金币、场均时长、分均金币";
info[1006] = "暂无词条，您也想出力的话请加群:810191707，备注来自本站";
info[1007] = "不同【技能 - 分路】的 占比、胜率";
info[1008] = "少则几千、多则数万种组合，仅推荐 场次、胜率 较高的前几十组";
info[1009] = "默认去除 出场率、胜率 较低的装备，点击可切换【英雄】【装备】";
info[1010] = "点击可同步国服备战 (出装、铭文)";
info[1011] = "近期【趋势】有明显上升的，上升过快极有可能挨刀，调整过的几个月内不会再动";
info[1012] = "左侧查看备战，右侧搜索舆论";
info[1013] = "未查询到，待更新";
info[1014] = "什么时候适合拿这个英雄呢";
info[1015] = "请在英雄详情界面 关注/取消关注";
info[1016] = "上下滑一滑就能看到相关调整了";
info[1017] = "已进入排序模式，拖拽/点击 英雄可修改，注意保存";
info[1018] = "iOS 使用 Safari 可添加到桌面，安卓推荐使用 Chrome 右上角添加到桌面";
info[1019] = "点击英雄可查看其他大区、省份信息";
info[1020] = "左右横滑、展开行可查看更多信息，一些没有图片的是批量上传的";
info[1021] = "禁选 = 禁用率 + 出场率 的总和";
info[1022] = "该列数据来源【王者营地】，【-】表示为 0 或 和上日对比无变化";
info[1023] = "该列数据来源【顶端巅峰赛】，点击上方【趋势】可以查看昨日平均分";
info[1024] = "请前往公众号【苏苏的荣耀助手】查看";
info[1025] = "这好像不是一个打野哦，稍后再来看看吧";
info[1026] = "结算界面的评分维度，是加分项哦";
info[1027] = "结算界面的高光时刻，是加分项哦";
info[1028] = "最近的更新记录，可以预测未来会不会有皮肤哦";
info[1029] = "已提交请求，将在稍后更新";
info[1030] = "当前展示的是历史存档，仅供参考";

const tips = new Array();
tips[1000] = "结算面板的出装统计，仅供参考";
tips[1010] = "数字箭头是【环比】，更新前后的变化";
tips[1001] = "点击可切换【英雄】【装备】";
tips[1002] = "点击可切换【视图】\n" + tips[1010] + "\n结算面板最终装备，可能会超过 100%";
tips[1003] = "挂边挂久了可能会变成边路\n中线吃多了可能会变成中路\n入侵、守野可能会变成打野";
tips[1004] = "出场越低，波动越大";
tips[1005] = "两个英雄同一队伍时，【一起】的数据";
tips[1006] = "群内 bo1，要来打内战吗";
tips[1007] = "数据来源互联网，仅供学习使用 ;b";
tips[1008] = "出该装备的英雄数量，小件胜率都不高";
tips[1009] = "默认展示【热度】较高的";
tips[1011] = "占比下方是【环比】，更新前后的变化";
tips[1012] = "点击可查看【装备】，格子占比和解释\n在第 x 个格子，出【该装备】的比较多";
tips[1013] = "点击可同步国服备战 (出装、铭文)";
tips[1014] = "优先展示职业、主播的名字\n隐藏玩家无法识别究竟是谁";
tips[1015] = "【左侧按钮】可自行修改显示 / 隐藏列";
tips[1016] = "近期趋势，优雅的寻找版本答案";
tips[1017] = "胜方经济，你达标了吗，仅供参考";
tips[1018] = "取每个人该英雄最新的场次，定义如下\n绿 < 50，橙 50 - 200，红 > 200 (场)\n你可以理解为熟练度占比，越多越熟练\nbp 高的，拿不到，绿色多，这很正常";
tips[1019] = "取每个人该英雄前玩的英雄，定义如下\n英雄_1 < 50 且 英雄_2 >= 50 (场)\n你可以理解为外来者，他们原来玩什么\nbp 高的，谁都可能会补，这很正常";
tips[1020] = "和上一位相差的票数";
tips[1021] = "按照当前【分均】追上上一位大概需要的时间";
tips[1022] = "输出占比 / 经济占比 = 转化";

const warning = new Array();
warning[500] = "loading...";
warning[750] = "本地只会拉取英雄列表，不会同步对局数据，请尽快注册获得更好的体验";
warning[1000] = "分辨率过小，可能会挡住英雄";
warning[1001] = "BP结束时，注意保存，点击【两侧边缘】可设置胜利方";
warning[1002] = "打开扩列后别人就能找到您啦";
warning[1003] = "不可提交黄赌毒以及违反国家法律的任何东西，违规者直接封号";
warning[1004] = "只是交换双方位置，并不会交换双方 BP 数据 (需要在 BP 开始前交换)";
warning[1005] = "当前分均预估的速度 (-1 追不上) ，仅供参考";
warning[1006] = "该账号只能扫码关注";
warning[1007] = "请先登录账号，完成绑定后，下次可用第三方登录";
warning[1008] = "账号验证失败，请重新登录后再试试";
warning[1009] = "绑定成功，下次可用第三方登录";
warning[1010] = "已经绑定，下次可用第三方登录，如需解绑请联系站长";

const success = new Array();
success[1000] = "操作成功";
success[1001] = "正在查看【该英雄】的装备数据";
success[1002] = "正在查看【该装备】的英雄数据";
success[1003] = "添加成功，请再选择一个队伍";
success[1004] = "发送成功";
success[1005] = "刷新成功";
success[1006] = "长按或右键保存图片";

const error = new Array();
error[1000] = "已超时";
error[1001] = "对局不存在";
error[1002] = "请点击左侧/右侧边缘设置胜利方，未设置默认蓝色方获胜";
error[1003] = "请按顺序BP";
error[1004] = "请选择 png/gif/jpg/jpeg 格式的图片";
error[1005] = "图片过大，请压缩后再上传";
error[1006] = "两支队伍不能相同";
error[1007] = "邮箱或密码为空";
error[1008] = "操作失败";
error[1009] = "请确认分数";
error[1010] = "请右上角【切换视图】";
error[1011] = "未登录不允许删除最后一局";
error[2000] = "请输入角色 Id";
error[2001] = "请选择职业";
error[2002] = "请输入帮会名字";

export default {
  info,
  warning,
  success,
  error,
  tips
}